const POEMS_DATA = [
    {
        "no":  1,
        "color":  "pink",
        "kami":  "秋の田の かりほの庵の 苫をあらみ",
        "simo":  "我が衣手は 露にぬれつつ",
        "kami_kana":  "あきのたの かりほのいほの とまをあらみ",
        "simo_kana":  "わがころもでは つゆにぬれつつ",
        "sakusya":  "天智天皇"
    },
    {
        "no":  2,
        "color":  "yellow",
        "kami":  "春過ぎて 夏来にけらし 白妙の",
        "simo":  "衣ほすてふ 天の香具山",
        "kami_kana":  "はるすぎて なつきにけらし しろたへの",
        "simo_kana":  "ころもほすてふ あまのかぐやま",
        "sakusya":  "持統天皇"
    },
    {
        "no":  3,
        "color":  "blue",
        "kami":  "あしびきの 山鳥の尾の しだり尾の",
        "simo":  "ながながし夜を ひとりかも寝む",
        "kami_kana":  "あしびきの やまどりのをの しだりをの",
        "simo_kana":  "ながながしよを ひとりかもねむ",
        "sakusya":  "柿本人麻呂"
    },
    {
        "no":  4,
        "color":  "pink",
        "kami":  "田子の浦に うちいでてみれば 白妙の",
        "simo":  "富士の高嶺に 雪は降りつつ",
        "kami_kana":  "たごのうらに うちいでてみれば しろたへの",
        "simo_kana":  "ふじのたかねに ゆきはふりつつ",
        "sakusya":  "山部赤人"
    },
    {
        "no":  5,
        "color":  "blue",
        "kami":  "奥山に もみぢふみわけ なく鹿の",
        "simo":  "声聞く時ぞ 秋はかなしき",
        "kami_kana":  "おくやまに もみぢふみわけ なくしかの",
        "simo_kana":  "こゑきくときぞ あきはかなしき",
        "sakusya":  "猿丸太夫"
    },
    {
        "no":  6,
        "color":  "blue",
        "kami":  "かささぎの 渡せる橋に おく霜の",
        "simo":  "白きをみれば 夜ぞふけにける",
        "kami_kana":  "かささぎの わたせるはしに おくしもの",
        "simo_kana":  "しろきをみれば よぞふけにける",
        "sakusya":  "中納言家持"
    },
    {
        "no":  7,
        "color":  "yellow",
        "kami":  "天の原 ふりさけみれば 春日なる",
        "simo":  "三笠の山に いでし月かも",
        "kami_kana":  "あまのはら ふりさけみれば かすがなる",
        "simo_kana":  "みかさのやまに いでしつきかも",
        "sakusya":  "阿倍仲麻呂"
    },
    {
        "no":  8,
        "color":  "green",
        "kami":  "わが庵は 都のたつみ しかぞすむ",
        "simo":  "世をうぢ山と 人はいふなり",
        "kami_kana":  "わがいほは みやこのたつみ しかぞすむ",
        "simo_kana":  "よをうぢやまと ひとはいふなり",
        "sakusya":  "喜撰法師"
    },
    {
        "no":  9,
        "color":  "green",
        "kami":  "花の色は うつりにけりな いたづらに",
        "simo":  "わが身よにふる ながめせしまに",
        "kami_kana":  "はなのいろは うつりにけりな いたづらに",
        "simo_kana":  "わがみよにふる ながめせしまに",
        "sakusya":  "小野小町"
    },
    {
        "no":  10,
        "color":  "yellow",
        "kami":  "これやこの 行くも帰るも わかれては",
        "simo":  "しるもしらぬも 逢坂の関",
        "kami_kana":  "これやこの ゆくもかへるも わかれては",
        "simo_kana":  "しるもしらぬも あふさかのせき",
        "sakusya":  "蝉丸"
    },
    {
        "no":  11,
        "color":  "green",
        "kami":  "わたの原 八十島かけて こぎいでぬと",
        "simo":  "人にはつげよ あまのつり舟",
        "kami_kana":  "わたのはら やそしまかけて こぎいでぬと",
        "simo_kana":  "ひとにはつげよ あまのつりぶね",
        "sakusya":  "参議篁"
    },
    {
        "no":  12,
        "color":  "blue",
        "kami":  "天つ風 雲のかよひ路 吹きとぢよ",
        "simo":  "をとめの姿 しばしとどめむ",
        "kami_kana":  "あまつかぜ くものかよひぢ ふきとぢよ",
        "simo_kana":  "をとめのすがた しばしとどめむ",
        "sakusya":  "僧正遍昭"
    },
    {
        "no":  13,
        "color":  "pink",
        "kami":  "つくばねの 峰よりおつる みなの川",
        "simo":  "恋ぞつもりて 淵となりぬる",
        "kami_kana":  "つくばねの みねよりおつる みなのがは",
        "simo_kana":  "こひぞつもりて ふちとなりぬる",
        "sakusya":  "陽成院"
    },
    {
        "no":  14,
        "color":  "blue",
        "kami":  "みちのくの しのぶもぢずり 誰ゆゑに",
        "simo":  "みだれそめにし 我ならなくに",
        "kami_kana":  "みちのくの しのぶもぢずり たれゆゑに",
        "simo_kana":  "みだれそめにし われならなくに",
        "sakusya":  "河原左大臣"
    },
    {
        "no":  15,
        "color":  "green",
        "kami":  "君がため 春の野に出でて 若菜つむ",
        "simo":  "わが衣手に 雪はふりつつ",
        "kami_kana":  "きみがため はるののにいでて わかなつむ",
        "simo_kana":  "わがころもでに ゆきはふりつつ",
        "sakusya":  "光孝天皇"
    },
    {
        "no":  16,
        "color":  "pink",
        "kami":  "立ちわかれ いなばの山の 峰に生ふる",
        "simo":  "まつとし聞かば いまかへりこむ",
        "kami_kana":  "たちわかれ いなばのやまの みねにおふる",
        "simo_kana":  "まつとしきかば いまかへりこむ",
        "sakusya":  "中納言行平"
    },
    {
        "no":  17,
        "color":  "green",
        "kami":  "ちはやぶる 神代もきかず 竜田川",
        "simo":  "からくれなゐに 水くくるとは",
        "kami_kana":  "ちはやぶる かみよもきかず たつたがは",
        "simo_kana":  "からくれなゐに みづくくるとは",
        "sakusya":  "在原業平朝臣"
    },
    {
        "no":  18,
        "color":  "yellow",
        "kami":  "住の江の 岸による波 よるさへや",
        "simo":  "夢のかよひ路 人目よくらむ",
        "kami_kana":  "すみのえの きしによるなみ よるさへや",
        "simo_kana":  "ゆめのかよひぢ ひとめよくらむ",
        "sakusya":  "藤原敏行朝臣"
    },
    {
        "no":  19,
        "color":  "orange",
        "kami":  "難波潟 みじかき蘆の ふしのまも",
        "simo":  "あはでこの世を すぐしてよとや",
        "kami_kana":  "なにはがた みじかきあしの ふしのまも",
        "simo_kana":  "あはでこのよを すぐしてよとや",
        "sakusya":  "伊勢"
    },
    {
        "no":  20,
        "color":  "green",
        "kami":  "わびぬれば いまはたおなじ 難波なる",
        "simo":  "身をつくしても あはむとぞ思ふ",
        "kami_kana":  "わびぬれば いまはたおなじ なにはなる",
        "simo_kana":  "みをつくしても あはむとぞおもふ",
        "sakusya":  "元良親王"
    },
    {
        "no":  21,
        "color":  "orange",
        "kami":  "今こむと いひしばかりに 長月の",
        "simo":  "有明の月を まちいでつるかな",
        "kami_kana":  "いまこむと いひしばかりに ながつきの",
        "simo_kana":  "ありあけのつきを まちいでつるかな",
        "sakusya":  "素性法師"
    },
    {
        "no":  22,
        "color":  "pink",
        "kami":  "吹くからに 秋の草木の しをるれば",
        "simo":  "むべ山風を 嵐といふらむ",
        "kami_kana":  "ふくからに あきのくさきの しをるれば",
        "simo_kana":  "むべやまかぜを あらしといふらむ",
        "sakusya":  "文屋康秀"
    },
    {
        "no":  23,
        "color":  "green",
        "kami":  "月みれば ちぢにものこそ かなしけれ",
        "simo":  "わが身一つの 秋にはあらねど",
        "kami_kana":  "つきみれば ちぢにものこそ かなしけれ",
        "simo_kana":  "わがみひとつの あきにはあらねど",
        "sakusya":  "大江千里"
    },
    {
        "no":  24,
        "color":  "blue",
        "kami":  "このたびは ぬさもとりあへず 手向山",
        "simo":  "もみぢのにしき 神のまにまに",
        "kami_kana":  "このたびは ぬさもとりあへず たむけやま",
        "simo_kana":  "もみぢのにしき かみのまにまに",
        "sakusya":  "菅家"
    },
    {
        "no":  25,
        "color":  "orange",
        "kami":  "名にし負はば 逢坂山の さねかづら",
        "simo":  "人にしられで 来るよしもがな",
        "kami_kana":  "なにしおはば あふさかやまの さねかづら",
        "simo_kana":  "ひとにしられで くるよしもがな",
        "sakusya":  "三条右大臣"
    },
    {
        "no":  26,
        "color":  "green",
        "kami":  "小倉山 峰のもみぢ葉 心あらば",
        "simo":  "いまひとたびの みゆきまたなむ",
        "kami_kana":  "をぐらやま みねのもみぢば こころあらば",
        "simo_kana":  "いまひとたびの みゆきまたなむ",
        "sakusya":  "貞信公"
    },
    {
        "no":  27,
        "color":  "orange",
        "kami":  "みかの原 わきて流るる いづみ川",
        "simo":  "いつみきとてか 恋しかるらむ",
        "kami_kana":  "みかのはら わきてながるる いづみがは",
        "simo_kana":  "いつみきとてか こひしかるらむ",
        "sakusya":  "中納言兼輔"
    },
    {
        "no":  28,
        "color":  "pink",
        "kami":  "山里は 冬ぞさびしさ まさりける",
        "simo":  "人目も草も かれぬと思へば",
        "kami_kana":  "やまざとは ふゆぞさびしさ まさりける",
        "simo_kana":  "ひとめもくさも かれぬとおもへば",
        "sakusya":  "源宗行朝臣"
    },
    {
        "no":  29,
        "color":  "green",
        "kami":  "心当てに 折らばや折らむ 初霜の",
        "simo":  "おきまどはせる 白菊の花",
        "kami_kana":  "こころあてに をらばやをらむ はつしもの",
        "simo_kana":  "おきまどはせる しらぎくのはな",
        "sakusya":  "凡河内躬恒"
    },
    {
        "no":  30,
        "color":  "blue",
        "kami":  "有明の つれなく見えし 別れより",
        "simo":  "あかつきばかり うきものはなし",
        "kami_kana":  "ありあけの つれなくみえし わかれより",
        "simo_kana":  "あかつきばかり うきものはなし",
        "sakusya":  "壬生忠岑"
    },
    {
        "no":  31,
        "color":  "blue",
        "kami":  "朝ぼらけ 有明の月と 見るまでに",
        "simo":  "吉野の里に 降れる白雪",
        "kami_kana":  "あさぼらけ ありあけのつきと みるまでに",
        "simo_kana":  "よしののさとに ふれるしらゆき",
        "sakusya":  "坂上是則"
    },
    {
        "no":  32,
        "color":  "yellow",
        "kami":  "山川に 風のかけたる しがらみは",
        "simo":  "ながれもあへぬ もみぢなりけり",
        "kami_kana":  "やまがはに かぜのかけたる しがらみは",
        "simo_kana":  "ながれもあへぬ もみぢなりけり",
        "sakusya":  "春道列樹"
    },
    {
        "no":  33,
        "color":  "yellow",
        "kami":  "久方の 光のどけき 春の日に",
        "simo":  "しづ心なく 花の散るらむ",
        "kami_kana":  "ひさかたの ひかりのどけき はるのひに",
        "simo_kana":  "しづこころなく はなのちるらむ",
        "sakusya":  "紀友則"
    },
    {
        "no":  34,
        "color":  "pink",
        "kami":  "誰をかも しる人にせむ 高砂の",
        "simo":  "松も昔の 友ならなくに",
        "kami_kana":  "たれをかも しるひとにせむ たかさごの",
        "simo_kana":  "まつもむかしの ともならなくに",
        "sakusya":  "藤原興風"
    },
    {
        "no":  35,
        "color":  "green",
        "kami":  "人はいさ 心も知らず ふるさとは",
        "simo":  "花ぞ昔の 香に匂ひける",
        "kami_kana":  "ひとはいさ こころもしらず ふるさとは",
        "simo_kana":  "はなぞむかしの かににほひける",
        "sakusya":  "紀貫之"
    },
    {
        "no":  36,
        "color":  "green",
        "kami":  "夏の夜は まだ宵ながら あけぬるを",
        "simo":  "雲のいづこに 月やどるらむ",
        "kami_kana":  "なつのよは まだよひながら あけぬるを",
        "simo_kana":  "くものいづこに つきやどるらむ",
        "sakusya":  "清原深養父"
    },
    {
        "no":  37,
        "color":  "yellow",
        "kami":  "白露に 風の吹きしく 秋の野は",
        "simo":  "つらぬきとめぬ 玉ぞ散りける",
        "kami_kana":  "しらつゆに かぜのふきしく あきののは",
        "simo_kana":  "つらぬきとめぬ たまぞちりける",
        "sakusya":  "文屋朝康"
    },
    {
        "no":  38,
        "color":  "green",
        "kami":  "忘らるる 身をば思はず ちかひてし",
        "simo":  "人の命の 惜しくもあるかな",
        "kami_kana":  "わすらるる みをばおもはず ちかひてし",
        "simo_kana":  "ひとのいのちの をしくもあるかな",
        "sakusya":  "右近"
    },
    {
        "no":  39,
        "color":  "yellow",
        "kami":  "浅茅生の 小野の篠原 しのぶれど",
        "simo":  "あまりてなどか 人の恋しき",
        "kami_kana":  "あさぢふの をののしのはら しのぶれど",
        "simo_kana":  "あまりてなどか ひとのこひしき",
        "sakusya":  "参議等"
    },
    {
        "no":  40,
        "color":  "pink",
        "kami":  "しのぶれど 色に出でにけり 我が恋は",
        "simo":  "物や思ふと 人の問ふまで",
        "kami_kana":  "しのぶれど いろにいでにけり わがこひは",
        "simo_kana":  "ものやおもふと ひとのとふまで",
        "sakusya":  "平兼盛"
    },
    {
        "no":  41,
        "color":  "green",
        "kami":  "恋すてふ 我が名はまだき 立ちにけり",
        "simo":  "人しれずこそ 思ひそめしか",
        "kami_kana":  "こひすてふ わがなはまだき たちにけり",
        "simo_kana":  "ひとしれずこそ おもひそめしか",
        "sakusya":  "壬生忠見"
    },
    {
        "no":  42,
        "color":  "green",
        "kami":  "ちぎりきな かたみに袖を しぼりつつ",
        "simo":  "末の松山 波こさじとは",
        "kami_kana":  "ちぎりきな かたみにそでを しぼりつつ",
        "simo_kana":  "すゑのまつやま なみこさじとは",
        "sakusya":  "清原元輔"
    },
    {
        "no":  43,
        "color":  "orange",
        "kami":  "あひみての のちの心に くらぶれば",
        "simo":  "昔は物を 思はざりけり",
        "kami_kana":  "あひみての のちのこころに くらぶれば",
        "simo_kana":  "むかしはものを おもはざりけり",
        "sakusya":  "権中納言敦忠"
    },
    {
        "no":  44,
        "color":  "orange",
        "kami":  "あふことの たえてしなくば なかなかに",
        "simo":  "人をも身をも 恨みざらまし",
        "kami_kana":  "あふことの たえてしなくば なかなかに",
        "simo_kana":  "ひとをもみをも うらみざらまし",
        "sakusya":  "中納言朝忠"
    },
    {
        "no":  45,
        "color":  "orange",
        "kami":  "あはれとも いふべき人は 思ほえで",
        "simo":  "身のいたづらに なりぬべきかな",
        "kami_kana":  "あはれとも いふべきひとは おもほえで",
        "simo_kana":  "みのいたづらに なりぬべきかな",
        "sakusya":  "謙徳公"
    },
    {
        "no":  46,
        "color":  "yellow",
        "kami":  "由良のとを 渡る舟人 かぢをたえ",
        "simo":  "ゆくへも知らぬ 恋の道かな",
        "kami_kana":  "ゆらのとを わたるふなびと かぢをたえ",
        "simo_kana":  "ゆくへもしらぬ こひのみちかな",
        "sakusya":  "曽禰好忠"
    },
    {
        "no":  47,
        "color":  "yellow",
        "kami":  "八重むぐら しげれる宿の さびしきに",
        "simo":  "人こそ見えね 秋は来にけり",
        "kami_kana":  "やへむぐら しげれるやどの さびしきに",
        "simo_kana":  "ひとこそみえね あきはきにけり",
        "sakusya":  "恵慶法師"
    },
    {
        "no":  48,
        "color":  "pink",
        "kami":  "風をいたみ 岩うつ波の おのれのみ",
        "simo":  "くだけて物を 思ふころかな",
        "kami_kana":  "かぜをいたみ いはうつなみの おのれのみ",
        "simo_kana":  "くだけてものを おもふころかな",
        "sakusya":  "源重之"
    },
    {
        "no":  49,
        "color":  "orange",
        "kami":  "みかきもり 衛士のたく火の 夜はもえ",
        "simo":  "昼は消えつつ 物をこそ思へ",
        "kami_kana":  "みかきもり ゑじのたくひの よるはもえ",
        "simo_kana":  "ひるはきえつつ ものをこそおもへ",
        "sakusya":  "大中臣能宣朝臣"
    },
    {
        "no":  50,
        "color":  "blue",
        "kami":  "君がため 惜しからざりし いのちさへ",
        "simo":  "長くもがなと 思ひけるかな",
        "kami_kana":  "きみがため をしからざりし いのちさへ",
        "simo_kana":  "ながくもがなと おもひけるかな",
        "sakusya":  "藤原義孝"
    },
    {
        "no":  51,
        "color":  "pink",
        "kami":  "かくとだに えやはいぶきの さしも草",
        "simo":  "さしもしらじな もゆる思ひを",
        "kami_kana":  "かくとだに えやはいぶきの さしもぐさ",
        "simo_kana":  "さしもしらじな もゆるおもひを",
        "sakusya":  "藤原実方朝臣"
    },
    {
        "no":  52,
        "color":  "orange",
        "kami":  "あけぬれば 暮るるものとは 知りながら",
        "simo":  "なほうらめしき 朝ぼらけかな",
        "kami_kana":  "あけぬれば くるるものとは しりながら",
        "simo_kana":  "なほうらめしき あさぼらけかな",
        "sakusya":  "藤原道信朝臣"
    },
    {
        "no":  53,
        "color":  "orange",
        "kami":  "なげきつつ ひとりぬる夜の あくるまは",
        "simo":  "いかに久しき ものとかはしる",
        "kami_kana":  "なげきつつ ひとりぬるよの あくるまは",
        "simo_kana":  "いかにひさしき ものとかはしる",
        "sakusya":  "右大将道綱母"
    },
    {
        "no":  54,
        "color":  "green",
        "kami":  "忘れじの ゆく末までは かたければ",
        "simo":  "今日をかぎりの いのちともがな",
        "kami_kana":  "わすれじの ゆくすゑまでは かたければ",
        "simo_kana":  "けふをかぎりの いのちともがな",
        "sakusya":  "儀同三司母"
    },
    {
        "no":  55,
        "color":  "yellow",
        "kami":  "滝の音は たえて久しく なりぬれど",
        "simo":  "名こそ流れて なほ聞こえけれ",
        "kami_kana":  "たきのおとは たえてひさしく なりぬれど",
        "simo_kana":  "なこそながれて なほきこえけれ",
        "sakusya":  "大納言公任"
    },
    {
        "no":  56,
        "color":  "orange",
        "kami":  "あらざらむ この世のほかの 思ひ出に",
        "simo":  "いまひとたびの あふこともがな",
        "kami_kana":  "あらざらむ このよのほかの おもひでに",
        "simo_kana":  "いまひとたびの あふこともがな",
        "sakusya":  "和泉式部"
    },
    {
        "no":  57,
        "color":  "blue",
        "kami":  "めぐりあひて 見しやそれとも わかぬまに",
        "simo":  "雲がくれにし 夜半の月かな",
        "kami_kana":  "めぐりあひて みしやそれとも わかぬまに",
        "simo_kana":  "くもがくれにし よはのつきかな",
        "sakusya":  "紫式部"
    },
    {
        "no":  58,
        "color":  "pink",
        "kami":  "ありま山 ゐなの笹原 風吹けば",
        "simo":  "いでそよ人を 忘れやはする",
        "kami_kana":  "ありまやま ゐなのささはら かぜふけば",
        "simo_kana":  "いでそよひとを わすれやはする",
        "sakusya":  "大弐三位"
    },
    {
        "no":  59,
        "color":  "green",
        "kami":  "やすらはで 寝なましものを さ夜ふけて",
        "simo":  "かたぶくまでの 月を見しかな",
        "kami_kana":  "やすらはで ねなましものを さよふけて",
        "simo_kana":  "かたぶくまでの つきをみしかな",
        "sakusya":  "赤染衛門"
    },
    {
        "no":  60,
        "color":  "yellow",
        "kami":  "大江山 いく野の道の 遠ければ",
        "simo":  "まだふみもみず 天の橋立",
        "kami_kana":  "おほえやま いくののみちの とほければ",
        "simo_kana":  "まだふみもみず あまのはしだて",
        "sakusya":  "小式部内侍"
    },
    {
        "no":  61,
        "color":  "blue",
        "kami":  "いにしへの 奈良の都の 八重桜",
        "simo":  "けふ九重に 匂ひぬるかな",
        "kami_kana":  "いにしへの ならのみやこの やへざくら",
        "simo_kana":  "けふここのへに にほひぬるかな",
        "sakusya":  "伊勢大輔"
    },
    {
        "no":  62,
        "color":  "blue",
        "kami":  "夜をこめて 鳥のそらねは はかるとも",
        "simo":  "よに逢坂の 関はゆるさじ",
        "kami_kana":  "よをこめて とりのそらねは はかるとも",
        "simo_kana":  "よにあふさかの せきはゆるさじ",
        "sakusya":  "清少納言"
    },
    {
        "no":  63,
        "color":  "orange",
        "kami":  "いまはただ 思ひ絶えなむ とばかりを",
        "simo":  "人づてならで 言ふよしもがな",
        "kami_kana":  "いまはただ おもひたえなむ とばかりを",
        "simo_kana":  "ひとづてならで いふよしもがな",
        "sakusya":  "左京大夫道雅"
    },
    {
        "no":  64,
        "color":  "orange",
        "kami":  "朝ぼらけ 宇治の川霧 絶え絶えに",
        "simo":  "あらはれわたる 瀬々の網代木",
        "kami_kana":  "あさぼらけ うぢのかはぎり たえだえに",
        "simo_kana":  "あらはれわたる せぜのあじろぎ",
        "sakusya":  "権中納言定頼"
    },
    {
        "no":  65,
        "color":  "pink",
        "kami":  "うらみわび ほさぬ袖だに あるものを",
        "simo":  "恋にくちなむ 名こそをしけれ",
        "kami_kana":  "うらみわび ほさぬそでだに あるものを",
        "simo_kana":  "こひにくちなむ なこそをしけれ",
        "sakusya":  "相模"
    },
    {
        "no":  66,
        "color":  "pink",
        "kami":  "もろともに あはれと思へ 山桜",
        "simo":  "花よりほかに 知る人もなし",
        "kami_kana":  "もろともに あはれとおもへ やまざくら",
        "simo_kana":  "はなよりほかに しるひともなし",
        "sakusya":  "前大僧正行尊"
    },
    {
        "no":  67,
        "color":  "orange",
        "kami":  "春の夜の 夢ばかりなる 手枕に",
        "simo":  "かひなくたたむ 名こそをしけれ",
        "kami_kana":  "はるのよの ゆめばかりなる たまくらに",
        "simo_kana":  "かひなくたたむ なこそをしけれ",
        "sakusya":  "周防内侍"
    },
    {
        "no":  68,
        "color":  "green",
        "kami":  "心にも あらでうき世に ながらへば",
        "simo":  "恋しかるべき 夜半の月かな",
        "kami_kana":  "こころにも あらでうきよに ながらへば",
        "simo_kana":  "こひしかるべき よはのつきかな",
        "sakusya":  "三条院"
    },
    {
        "no":  69,
        "color":  "blue",
        "kami":  "あらし吹く み室の山の もみぢばは",
        "simo":  "竜田の川の 錦なりけり",
        "kami_kana":  "あらしふく みむろのやまの もみぢばは",
        "simo_kana":  "たつたのかはの にしきなりけり",
        "sakusya":  "能因法師"
    },
    {
        "no":  70,
        "color":  "blue",
        "kami":  "さびしさに 宿を立ち出でて ながむれば",
        "simo":  "いづくもおなじ 秋の夕ぐれ",
        "kami_kana":  "さびしさに やどをたちいでて ながむれば",
        "simo_kana":  "いづくもおなじ あきのゆふぐれ",
        "sakusya":  "良選法師"
    },
    {
        "no":  71,
        "color":  "green",
        "kami":  "夕されば 門田の稲葉 おとづれて",
        "simo":  "蘆のまろやに 秋風ぞ吹く",
        "kami_kana":  "ゆふされば かどたのいなば おとづれて",
        "simo_kana":  "あしのまろやに あきかぜぞふく",
        "sakusya":  "大納言経信"
    },
    {
        "no":  72,
        "color":  "pink",
        "kami":  "音に聞く 高師の浜の あだ波は",
        "simo":  "かけじや袖の ぬれもこそすれ",
        "kami_kana":  "おとにきく たかしのはまの あだなみは",
        "simo_kana":  "かけじやそでの ぬれもこそすれ",
        "sakusya":  "祐子内親王家紀伊"
    },
    {
        "no":  73,
        "color":  "pink",
        "kami":  "高砂の をのへのさくら さきにけり",
        "simo":  "とやまのかすみ たたずもあらなむ",
        "kami_kana":  "たかさごの をのへのさくら さきにけり",
        "simo_kana":  "とやまのかすみ たたずもあらなむ",
        "sakusya":  "前権中納言匡房"
    },
    {
        "no":  74,
        "color":  "blue",
        "kami":  "憂かりける 人を初瀬の 山おろしよ",
        "simo":  "はげしかれとは 祈らぬものを",
        "kami_kana":  "うかりける ひとをはつせの やまおろしよ",
        "simo_kana":  "はげしかれとは いのらぬものを",
        "sakusya":  "源俊頼朝臣"
    },
    {
        "no":  75,
        "color":  "blue",
        "kami":  "ちぎりおきし させもが露を いのちにて",
        "simo":  "あはれ今年の 秋もいぬめり",
        "kami_kana":  "ちぎりおきし させもがつゆを いのちにて",
        "simo_kana":  "あはれことしの あきもいぬめり",
        "sakusya":  "藤原基俊"
    },
    {
        "no":  76,
        "color":  "blue",
        "kami":  "わたの原 こぎいでてみれば 久方の",
        "simo":  "雲いにまがふ 沖つ白波",
        "kami_kana":  "わたのはら こぎいでてみれば ひさかたの",
        "simo_kana":  "くもゐにまがふ おきつしらなみ",
        "sakusya":  "法性寺入道前関白太政大臣"
    },
    {
        "no":  77,
        "color":  "orange",
        "kami":  "瀬をはやみ 岩にせかるる 滝川の",
        "simo":  "われても末に あはむとぞ思ふ",
        "kami_kana":  "せをはやみ いはにせかるる たきがはの",
        "simo_kana":  "われてもすゑに あはむとぞおもふ",
        "sakusya":  "崇徳院"
    },
    {
        "no":  78,
        "color":  "yellow",
        "kami":  "淡路島 かよふ千鳥の 鳴く声に",
        "simo":  "幾夜ねざめぬ 須磨の関守",
        "kami_kana":  "あはぢしま かよふちどりの なくこゑに",
        "simo_kana":  "いくよねざめぬ すまのせきもり",
        "sakusya":  "源兼昌"
    },
    {
        "no":  79,
        "color":  "yellow",
        "kami":  "秋風に たなびく雲の たえ間より",
        "simo":  "もれいづる月の 影のさやけさ",
        "kami_kana":  "あきかぜに たなびくくもの たえまより",
        "simo_kana":  "もれいづるつきの かげのさやけさ",
        "sakusya":  "左京大夫顕輔"
    },
    {
        "no":  80,
        "color":  "pink",
        "kami":  "長からむ 心もしらず 黒髪の",
        "simo":  "みだれてけさは 物をこそ思へ",
        "kami_kana":  "ながからむ こころもしらず くろかみの",
        "simo_kana":  "みだれてけさは ものをこそおもへ",
        "sakusya":  "待賢門院堀河"
    },
    {
        "no":  81,
        "color":  "yellow",
        "kami":  "ほととぎす 鳴きつる方を ながむれば",
        "simo":  "ただありあけの 月ぞ残れる",
        "kami_kana":  "ほととぎす なきつるかたを ながむれば",
        "simo_kana":  "ただありあけの つきぞのこれる",
        "sakusya":  "後徳大寺左大臣"
    },
    {
        "no":  82,
        "color":  "blue",
        "kami":  "思ひわび さてもいのちは あるものを",
        "simo":  "憂きにたへぬは 涙なりけり",
        "kami_kana":  "おもひわび さてもいのちは あるものを",
        "simo_kana":  "うきにたへぬは なみだなりけり",
        "sakusya":  "道因法師"
    },
    {
        "no":  83,
        "color":  "pink",
        "kami":  "世の中よ 道こそなけれ 思ひ入る",
        "simo":  "山の奥にも 鹿ぞ鳴くなる",
        "kami_kana":  "よのなかよ みちこそなけれ おもひいる",
        "simo_kana":  "やまのおくにも しかぞなくなる",
        "sakusya":  "皇太后宮大夫俊成"
    },
    {
        "no":  84,
        "color":  "pink",
        "kami":  "ながらへば またこのごろや しのばれむ",
        "simo":  "憂しと見し世ぞ 今は恋しき",
        "kami_kana":  "ながらへば またこのごろや しのばれむ",
        "simo_kana":  "うしとみしよぞ いまはこひしき",
        "sakusya":  "藤原清輔朝臣"
    },
    {
        "no":  85,
        "color":  "yellow",
        "kami":  "夜もすがら 物思ふころは 明けやらで",
        "simo":  "閨のひまさへ つれなかりけり",
        "kami_kana":  "よもすがら ものおもふころは あけやらで",
        "simo_kana":  "ねやのひまさへ つれなかりけり",
        "sakusya":  "俊恵法師"
    },
    {
        "no":  86,
        "color":  "pink",
        "kami":  "なげけとて 月やは物を 思はする",
        "simo":  "かこち顔なる わが涙かな",
        "kami_kana":  "なげけとて つきやはものを おもはする",
        "simo_kana":  "かこちがほなる わがなみだかな",
        "sakusya":  "西行法師"
    },
    {
        "no":  87,
        "color":  "yellow",
        "kami":  "村雨の 露もまだひぬ まきの葉に",
        "simo":  "霧たちのぼる 秋の夕ぐれ",
        "kami_kana":  "むらさめの つゆもまだひぬ まきのはに",
        "simo_kana":  "きりたちのぼる あきのゆふぐれ",
        "sakusya":  "寂蓮法師"
    },
    {
        "no":  88,
        "color":  "orange",
        "kami":  "難波江の 蘆のかりねの ひとよゆゑ",
        "simo":  "みをつくしてや 恋ひわたるべき",
        "kami_kana":  "なにはえの あしのかりねの ひとよゆゑ",
        "simo_kana":  "みをつくしてや こひわたるべき",
        "sakusya":  "皇嘉門院別当"
    },
    {
        "no":  89,
        "color":  "yellow",
        "kami":  "玉の緒よ たえなばたえね ながらへば",
        "simo":  "忍ぶることの 弱りもぞする",
        "kami_kana":  "たまのをよ たえなばたえね ながらへば",
        "simo_kana":  "しのぶることの よわりもぞする",
        "sakusya":  "式子内親王"
    },
    {
        "no":  90,
        "color":  "orange",
        "kami":  "見せばやな 雄島のあまの 袖だにも",
        "simo":  "ぬれにぞぬれし 色はかはらず",
        "kami_kana":  "みせばやな をじまのあまの そでだにも",
        "simo_kana":  "ぬれにぞぬれし いろはかはらず",
        "sakusya":  "殷富門院大輔"
    },
    {
        "no":  91,
        "color":  "blue",
        "kami":  "きりぎりす 鳴くや霜夜の さむしろに",
        "simo":  "衣かたしき ひとりかも寝む",
        "kami_kana":  "きりぎりす なくやしもよの さむしろに",
        "simo_kana":  "ころもかたしき ひとりかもねむ",
        "sakusya":  "後京極摂政前太政大臣"
    },
    {
        "no":  92,
        "color":  "green",
        "kami":  "わが袖は 潮干にみえぬ 沖の石の",
        "simo":  "人こそしらね かわくまもなし",
        "kami_kana":  "わがそでは しほひにみえぬ おきのいしの",
        "simo_kana":  "ひとこそしらね かわくまもなし",
        "sakusya":  "二条院讃岐"
    },
    {
        "no":  93,
        "color":  "green",
        "kami":  "世の中は つねにもがもな なぎさこぐ",
        "simo":  "あまの小舟の 綱手かなしも",
        "kami_kana":  "よのなかは つねにもがもな なぎさこぐ",
        "simo_kana":  "あまのをぶねの つなでかなしも",
        "sakusya":  "鎌倉右大臣"
    },
    {
        "no":  94,
        "color":  "yellow",
        "kami":  "み吉野の 山の秋風 さ夜ふけて",
        "simo":  "ふるさと寒く 衣うつなり",
        "kami_kana":  "みよしのの やまのあきかぜ さよふけて",
        "simo_kana":  "ふるさとさむく ころもうつなり",
        "sakusya":  "参議雅経"
    },
    {
        "no":  95,
        "color":  "orange",
        "kami":  "おほけなく うき世の民に おほふかな",
        "simo":  "わがたつ杣に 墨染の袖",
        "kami_kana":  "おほけなく うきよのたみに おほふかな",
        "simo_kana":  "わがたつそまに すみぞめのそで",
        "sakusya":  "前大僧正慈円"
    },
    {
        "no":  96,
        "color":  "yellow",
        "kami":  "花さそふ 嵐の庭の 雪ならで",
        "simo":  "ふりゆくものは わが身なりけり",
        "kami_kana":  "はなさそふ あらしのにはの ゆきならで",
        "simo_kana":  "ふりゆくものは わがみなりけり",
        "sakusya":  "入道前太政大臣"
    },
    {
        "no":  97,
        "color":  "pink",
        "kami":  "こぬ人を まつほの浦の 夕なぎに",
        "simo":  "焼くやもしほの 身もこがれつつ",
        "kami_kana":  "こぬひとを まつほのうらの ゆふなぎに",
        "simo_kana":  "やくやもしほの みもこがれつつ",
        "sakusya":  "権中納言定家"
    },
    {
        "no":  98,
        "color":  "orange",
        "kami":  "風そよぐ ならの小川の 夕ぐれは",
        "simo":  "みそぎぞ夏の しるしなりける",
        "kami_kana":  "かぜそよぐ ならのをがはの ゆふぐれは",
        "simo_kana":  "みそぎぞなつの しるしなりける",
        "sakusya":  "従二位家隆"
    },
    {
        "no":  99,
        "color":  "orange",
        "kami":  "人もをし 人もうらめし あぢきなく",
        "simo":  "世を思ふゆゑに 物思ふ身は",
        "kami_kana":  "ひともをし ひともうらめし あぢきなく",
        "simo_kana":  "よをおもふゆゑに ものおもふみは",
        "sakusya":  "後鳥羽院"
    },
    {
        "no":  100,
        "color":  "blue",
        "kami":  "ももしきや ふるき軒ばの しのぶにも",
        "simo":  "なほあまりある 昔なりけり",
        "kami_kana":  "ももしきや ふるきのきばの しのぶにも",
        "simo_kana":  "なほあまりある むかしなりけり",
        "sakusya":  "順徳院"
    }
];

const KIMARIJI_DATA = {
      1: "あきの", 2: "はるす", 3: "あし", 4: "たご", 5: "おく", 6: "かさ", 7: "わがそ", 8: "わがい", 9: "はなの", 10: "これ",
      11: "わたのはらや", 12: "あまつ", 13: "つく", 14: "みち", 15: "きみがためは", 16: "たち", 17: "ちは", 18: "す", 19: "なにはが", 20: "わび",
      21: "いまこ", 22: "ふ", 23: "つき", 24: "この", 25: "にし", 26: "をぐ", 27: "みかき", 28: "みかぬ", 29: "おくやまにし", 30: "わたのはらこ",
      31: "あさぼらけあ", 32: "やまが", 33: "ひさ", 34: "たれ", 35: "い", 36: "なつ", 37: "しら", 38: "わす", 39: "あさじ", 40: "しの",
      41: "こひ", 42: "ちぎりき", 43: "あひ", 44: "あふこ", 45: "あわれ", 46: "ゆら", 47: "やへ", 48: "かぜを", 49: "みかさ", 50: "きみがためよ",
      51: "かく", 52: "ありあ", 53: "なげき", 54: "わすれ", 55: "たき", 56: "あらざ", 57: "め", 58: "ありま", 59: "やす", 60: "おおえ",
      61: "いに", 62: "よを", 63: "いまは", 64: "あさぼらけう", 65: "うら", 66: "もろ", 67: "はるの", 68: "こぬ", 69: "あらし", 70: "さ",
      71: "いづ", 72: "おと", 73: "たか", 74: "うか", 75: "ちぎりお", 76: "わたのはらな", 77: "せ", 78: "あはぢ", 79: "あきか", 80: "ながか",
      81: "ほと", 82: "おも", 83: "よのなかよ", 84: "ながら", 85: "よも", 86: "なげけ", 87: "む", 88: "なにはえ", 89: "たま", 90: "みせ",
      91: "きり", 92: "わがそ", 93: "よのなかは", 94: "みよ", 95: "おおけ", 96: "はなさ", 97: "こぬ", 98: "かぜそ", 99: "ひとも", 100: "もも"
    };